## 正则表达式

# http://www.ityouknow.com/python/2019/11/19/python-re-063.html


# 在正则表达式中，可以使用 “\d” 匹配数字，“\w” 匹配数字和子母，“.” 可以匹配除了换行符之外的任意字符，“\s” 匹配空白字符

#要匹配长字符串在正则表达式中，用 “+” 表示匹配至少一个字符，用 "?" 表示匹配0或1个字符，用 {n} 表示匹配n个字符，用 {n,m} 表示匹配n-m个字符



# 正则表达式可以更加的复杂：([A-Za-z0-9_\-\.]+)\@([A-Za-z0-9_\-\.]+)\.([A-Za-z]{2,4})

# ( )：表示分组

# [ ]：表示在[ ]内的任意一个字符

# ([A-Za-z0-9-.]+)：表示以大写字母 [A-Z]、小写字母 [a-z]、数字 [0-9]、下划线 []、减号 [-]、点号 [.] 中的至少一个字符 [+] ，在正则表达式中减号 [-] 和点号 [.] 是特殊字符需要使用 [] 转义

# \@：邮件中的@符号

# ([A-Za-z0-9-.]+)：表示以大写字母 [A-Z]、小写字母 [a-z]、数字 [0-9]、下划线 []、减号 [-]、点号 [.] 中的至少一个字符 [+]，如：qq，sina

# .([A-Za-z]{2,4})：表示以点号 [.] 连接2-4 [{2,4}] 个字符的大写字母 [A-Z] 和小写字母 [a-z]





###############################################################################################################

